dict_ticket={'G1569':['北京南—成都北','18:03','18:30','33'],
             'G1567':['北京南—成都北','18:10','1840','34'],
             'G8917':['北京南—荆州北','18:20','18:50','58'],
             'G203':['北京南—成都北','18:55','19:18','37']}
print('车次   出发站—到达站   出发时间   到达时间隔   历时时长')
#遍历字典中的元素
for key in dict_ticket.keys():
    print(key,end='   ')
    for item in dict_ticket.get(key):
        print(item,end='\t\t')

    print()#换行

#输入用户的购票车次
train_no=input('请输入要购票的车次：')

#根据键获取值
info=dict_ticket.get(train_no,'车次不存在')
#判断车次是否存在
if info!='车次不存在':
    person=input('请输入乘车人，如果是多人乘车使用逗号分割:')

    #获取车次的出发站—到达站，还有出发时间
    s=info[0]+' '+info[1] +'开'
    print('您已购买了'+train_no+' '+s+',请'+person+'尽快换取纸质车票,【黄泉铁路】')
else:
    print('对不起,选择的车次可能不存在')
    print('如有疑问请您拨打我们的客服服务热线：770880')
# lst=[
#     ['车次','出发站—到达站','出发时间','到达时间隔','历时时长'],
#     ['G1569','北京南—成都北','18:03','18:30','33'],
#     ['G1567','北京南—成都北','18:10','1840','34'],
#     ['G8917','北京南—荆州北','18:20','18:50','58'],
#     ['G203','北京南—成都北','18:55','19:18','37']
# ]
# print('车次表为：')
# print('-'*43)
# for row in lst:
#     for item in row:
#         print(item,end='\t')
#     print()
# while true:
#     ticket=input('请输入需要购票的车次：')
    #需要遍历其与[1][0],[1][1],[1][2]遍历比对车次是否存在，若正确进行身份填写——》显示购买XX车次成功-》若又输入q，显示退出购票系统-》打印请XXX前往站台XX
    #有点麻烦，还是字典好使


